Repository: jalgas93/dictionary_EN_RU_QQ
Catalog: lib/l10n/intl_*.arb
Languages: ru, uz

# custom_continue
source: Continue
ru: Продолжить
uz: Davom etish

source: cancel
ru: Отмена
uz: Bekor qilish

source: Business
ru: Бизнес
uz: Biznes

source: Private
ru: Частное
uz: Xususiy

source: Information
ru: Информация
uz: Ma'lumot

source: Description
ru: Описание
uz: Tavsif

# deletingAd
source: Deleting an ad
ru: Удаление объявления
uz: Reklamani o'chirish

source: Username
ru: Имя пользователя
uz: Foydalanuvchi nomi

source: Direction👇
ru: Нарпавление👇
uz: Yo'nalish👇

source: User name
ru: Имя пользователь
uz: Foydalanuvchi nomi

source: Free
ru: Свободен
uz: Бошман

# from
source: from {num}
ru: c {num}
uz: {num} dan

# to
source: to {num}
ru: до {num}
uz: {num} gacha

# wantDeletePublication
source: Are you sure you want to delete this ad
ru: Точно хотитье удалить этот объявление
uz: Siz, ushbu reklamani o'chirishni xohlaysiz mi ?

source: Address
ru: Адрес
uz: Manzil

# wantToCall
source: Do you want to call this number
ru: Хотите позвонить на этот номер ?
uz: Ushbu raqamga qo'ng'iroq qilmoqchimisiz ?

source: Call
ru: Позвонить
uz: Qo'ng'iroq qilish

source: Phone
ru: Tелефон
uz: Telefon

source: Map
ru: Карта
uz: xarita

# noData
source: No data available
ru: Нет данных
uz: Ma'lumotlar yo'q

# addFavorites
source: Added to favorites
ru: Добавлен в избранное
uz: Sevimlilarga qo'shildi

# newPartTimeJobs
source: New ads
ru: Новые объявления
uz: Yangi e'lonlar

source: Loading data......
ru: Загрузка данных......
uz: Ma'lumotlarni yuklash......

# currentLocation
source: User's current location
ru: Текущее местоположение пользователя
uz: Foydalanuvchining joriy joylashuvi

# locationService_detection
source: Location detection service is disabled
ru: Служба определения местоположения отключена
uz: Joylashuvni aniqlash xizmati o'chirilgan

source: Location permissions denied
ru: В разрешениях на определение местоположения отказано
uz: Joylashuv ruxsatnomalari rad etildi

# weCant_requestPermission
source: Location permissions are permanently denied, we cannot request permission
ru: В разрешениях на определение местоположения постоянно отказано, мы не можем запросить разрешение
uz: Joylashuv ruxsatnomalari doimiy ravishda rad etiladi, biz ruxsat so'rashimiz mumkin emas

# exit
source: Log out of the profile
ru: Выход из профиля
uz: Profildan chiqish

source: Help
ru: Помощь
uz: Yordam

# settings_profile
source: Profile Settings
ru: Настройки профиля
uz: Profil sozlamalari

source: Share
ru: Делиться
uz: Ulashish

source: Friends
ru: Друзья
uz: Do'stlar

source: Favourites
ru: Избранное
uz: Sevimlilar

source: Free time
ru: Свободное время
uz: Bo'sh vaqt

source: About me
ru: О себе
uz: O'zingiz haqingizda

source: City
ru: Город
uz: Shahar

# data_employer
source: Employee data 👇
ru: Данные работника 👇
uz: Xodim ma'lumotlari 👇

source: Name
ru: Имя
uz: Ism

source: Empty
ru: Пустой
uz: Bo'sh

source: Profile
ru: Профиль
uz: Profil

source: User Profile
ru: Профиль пользователя
uz: Foydalanuvchi profili

# uploadingPhone_profile
source: Upload a photo for your profile
ru: Загрузите фото для вашего профилья,
uz: Profilingiz uchun fotosuratni yuklang

# addPhoto_publication
source: Add a photo for your publications
ru: Добавить фото для вашего публикаций
uz: Nashrlaringiz uchun rasm qo'shing

source: Uploading photos
ru: Загрузка фото
uz: Fotosuratlarni yuklash

source: Mistake
ru: Ошибка
uz: Xato

# agree
source: to Accept
ru: Принят
uz: Qabul qilingan

source: Notification
ru: Уведомление
uz: Xabarnoma

source: Publication
ru: Публикация
uz: Nashr

# professionals
source: Specialists
ru: Специалисты
uz: Mutaxassislar

# creatingAd
source: Create an ad
ru: Создайте объявление
uz: Reklama yarating

# describeDetail
source: Describe in detail
ru: Опишите в подробностях
uz: Batafsil tavsiflang

source: Title Ad
ru: Заголовок объявление
uz: Sarlavha e'lon

source: Required field
ru: Поле обязательное
uz: Majburiy maydon

# forExample
source: Your specialty and skills
ru: Вашa специальность и навыки
uz: Sizning mutaxassisligingiz va ko'nikmalaringiz

# mySpecialty
source: My specialty is
ru: Моя специальность
uz: Mening mutaxassisligim

# atLeast_70
source: At least 50 non-letters {length}
ru: Не меньше 50 не букв {length}
uz: Не меньше 50 не букв {length}

# description_aboutYou
source: Think about what details you would like to show on the ad. And add them to the description.
ru: Подумайте, какие подробности вы хотели бы показать на объявление. И добавьте их в описание.
uz: E'londa qanday tafsilotlarni ko'rsatishni xohlayotganingizni o'ylab ko'ring. Va ularni tavsifga qo'shing.

# private_business
source: Private or business
ru: Частное или бизнес
uz: Xususiy yoki biznes

source: Location your address
ru: Местоположение ваш адрес
uz: Joylashuv, sizning manzilingiz

# cityTown
source: City, Address
ru: Город, Адрес
uz: Shahar, Manzil

source: Contact person
ru: Контактное лицо
uz: Aloqa qiluvchi shaxs

source: phone number
ru: номер телефона
uz: telefon raqami

# createAd
source: Create an ad
ru: Создать объявление
uz: Reklama yarating

source: Done
ru: Сделано
uz: Bajarildi

# addData_work
source: Add data to determine the level of training
ru: Добавьте данные для определения уровня подготовки
uz: Tayyorgarlik darajasini aniqlash uchun ma'lumotlarni qo'shing

# for_example
source: What kind of specialists are you looking for ?
ru: Каких специалистов вы ищите ?
uz: Siz qanday mutaxassislarni qidiryapsiz ?

# freeTime_write
source: Free time
ru: Свободное время
uz: Bo'sh vaqtingiz

# update
source: Complete
ru: Завершить
uz: Tugatish

# notChat_withPeople
source: No correspondence with users
ru: Нет переписки с пользовательями
uz: Foydalanuvchilar bilan yozishmalar yo'q

source: Photo
ru: Фото
uz: Rasm

source: File
ru: Файл
uz: Fayl

source: Chat
ru: Чат
uz: Suhbat

# thinkAbout_description
source: Think about what details you would like to show on the ad. And add them to the description.
ru: Подумайте, какие подробности вы хотели бы показать на объявление. И добавьте их в описание.
uz: Reklamada qanday tafsilotlarni ko'rsatishni xohlayotganingizni o'ylab ko'ring. Va ularni tavsifga qo'shing.

# message
source: Messages
ru: Сообщения
uz: Xabarlar

source: Language
ru: Язык
uz: Til

source: Time
ru: Время
uz: Vaqt

source: Tape
ru: Лента
uz: Lenta

# selected_language
source: Select a language
ru: Выберите язык
uz: Tilni tanlang

# willBe_available
source: Will be available soon
ru: Cкоро будет доступно
uz: Tez orada mavjud bo'ladi

# add_photo
source: Add a photo
ru: Добавьте фото
uz: Rasm qo'shing

source: Login
ru: Авторизоваться
uz: Kirish

source: Password
ru: Пароль
uz: Maxfiy so'z

source: Register
ru: Зарегистрировать
uz: Ro'yxatdan o'tish

source: Authorization
ru: Авторизация
uz: Avtorizatsiya

# check_data
source: Add a photo
ru: Добавить фотографию
uz: Rasm qo'shing

source: Error
ru: Ошибка
uz: Xato

# how_register
source: Registration how ?
ru: Как пройти регистрацию ?
uz: Ro'yxatdan qanday otish ?

# howRegistration_description
source: You can register as a part-time job or as a user. 1. YES ---> Part-time job 2. No ---> User
ru: Вы можете зарегистрироваться как работающий неполный рабочий день или как пользователь. 1. ДА ---> Работа на неполный рабочий день 2. Нет ---> Пользователь
uz: Siz qo‘shimcha ish yoki foydalanuvchi sifatida ro'yxatdan o'tishingiz mumkin. 1. Ha - - - > Yarim kunlik ish 2. Yo'q - - - > Foydalanuvchi

source: No
ru: Нет
uz: Yo'q

source: Yes
ru: Да
uz: Ha

# cropper
source: Photo correction
ru: Корректировка фото
uz: Fotosuratni sozlash

source: Remove
ru: Удалять
uz: Olib tashlash

# uploadImage_forBegin
source: Upload an image to get started
ru: Загрузите изображение, чтобы начать работу
uz: Boshlash uchun rasmni yuklang

# upload
source: Download
ru: Загрузить
uz: Yuklash

source: Part-time job
ru: Подработка
uz: Qo‘shimcha ish

# bannerPage_first
source: additional work in addition to the main occupation.
ru: дополнительная работа помимо основного занятия.
uz: asosiy ishdan tashqari qo'shimcha ish.

# bannerPage_second
source: Can you find the right specialists
ru: Можете найти нужных специалистов
uz: Siz kerakli mutaxassislarni topishingiz mumkin

# bannerPage_secondAgain
source: easy and fast
ru: легко и быстро
uz: oson va tez

# bannerPage_third
source: If you are a good specialist
ru: Если вы хороший специалист
uz: Agar siz yaxshi mutaxassis bo'lsangiz

# bannerPage_thirdAgain
source: you can place ads in your directions.
ru: в своем направлении можете разместить объявления.
uz: siz o'z yo'nalishlaringizda reklama joylashtirishingiz mumkin.

# bannerPage_thirdDesc
source: work in your free time in addition to your main occupation
ru: Работа в свободное время помимо основного занятия
uz: Asosiy ishdan tashqari bo'sh vaqtda ishlash uchun

# error_data
source: Check the data
ru: Проверьте данные
uz: Ma'lumotlarni tekshiring

source: Delete Account
ru: Удалить учетную запись
uz: Profilni o'chirish

# textDelete_account
source: Delete your Account?
ru: Удалить свою учетную запись?
uz: Hisobingizni o'chirasizmi?

# delete_accountDesc
source: If you select delete, we will delete your account on our server. All your data will be deleted and you will not be able to recover it.
ru: Если вы выберите удалить, мы удалим вашу учетную запись на нашем сервере. Все ваши данные будуть удалены, и вы не сможете их восстановить.
uz: Agar o'chirishni tanlasangiz, biz sizning akkountni serverimizdan o'chirib tashlaymiz. Sizning barcha ma'lumotlaringiz o'chiriladi va siz uni qayta tiklay olmaysiz.

source: Delete
ru: Удалить
uz: O'chirish

# delete_notification
source: Deleting Notifications
ru: Удаление уведомлений
uz: Bildirishnomalarni o'chirish

# delete_notification_desc
source: Are you sure you want to delete this notification?
ru: Точно хотите удалить этот уведомление ?
uz: Ushbu bildirishnomani olib tashlamoqchimisiz ?

# work_PartTime
source: Do you want to work ?
ru: Хотите ли вы работать ?
uz: Siz ishlashni xohlaysizmi ?

# i_work_PartTime
source: I want to work part time
ru: Я хочу работать подработку
uz: Men bo'sh vaqtda ishlashni xohlayman

# no_thanks
source: Refuse
ru: Отказаться
uz: Rad etish

# turn_on
source: To accept
ru: Принять
uz: Qabul qilish

# use_location
source: Location data in the background
ru: Данные о местоположении в фоновом режиме
uz: Orqa fonda joylashuv ma'lumotlari

# location_description_first
source: It is necessary to automatically determine your location in order to automatically indicate your city and address
ru: Необходимо для автоматического определения вашего местоположения, чтоб автоматически указывать Ваш город и адрес
uz: Sizning shahringiz va manzilingizni avtomatik ravishda ko'rsatish uchun joylashuvingizni avtomatik ravishda aniqlash kerak

# location_description_second
source: By creating an ad and enabling location data in the background, employers (employees) will see your location, which can simplify the selection of a specialist (job).
ru: Создав объявление и включив данные о местоположения в фоновом режиме, работодатели (работники) будут видеть Ваше местоположение, что может упростить подбор специалиста (работы).
uz: E'lonni yaratish va fonda joylashuv ma'lumotlarini yoqish orqali ish beruvchilar (ishchilar) sizning joylashuvingizni ko'rishadi, bu esa mutaxassisni (ishni) tanlashni osonlashtirishi mumkin.

# location_description_third
source: If you are the right specialist, would like to be found by people near you.
ru: Если вы нужный специалист, хотели бы вас нашли люди рядом к вам.
uz: Agar siz kerakli mutaxassis bo'lsangiz, sizga yaqin odamlar sizni topishni xohlasangiz.

source: Welcome
ru: Добро пожаловать
uz: Xush kelibsiz

# verification_number
source: Checking the number
ru: Проверка номера
uz: Raqamni tekshirish

# otp_sms
source: We have sent you a code to the {phone} number
ru: Мы отправили вам код на номер {phone}
uz: Biz sizga {phone} raqamiga kod yubordik

# correct_otp_sms
source: Write the correct code from the sms
ru: Напишите правильный код из смс
uz: SMS - dan to'g'ri kodni yozing

source: Check...
ru: Проверка...
uz: Tekshirish...

source: Send
ru: Отправить
uz: Yuborish

# try_again
source: Request the code again
ru: Запросить код повторно
uz: Kodni qayta yuborish

# second
source: {count} seconds
ru: {count} секунд
uz: {count} soniya

# login_phone
source: Log in by phone number
ru: Войдите по номеру телефона
uz: Telefon raqami bilan kiring

# done_text
source: Done
ru: Готово
uz: Tayyor

# location_permission
source: Location Permissions
ru: Разрешения на местоположение
uz: Joylashuv ruxsatnomalari

# write_number
source: Write the phone number
ru: Напишите номер телефона
uz: Telefon raqamini yozing

# loginBy_number
source: Log in using your phone
ru: Войдите в систему с помощью телефона
uz: Telefoningiz bilan tizimga kiring

# noSelected_location
source: Specify your current location to sort ads by your location
ru: Укажите текущего мecтоположения, чтобы по вашему местоположению сортировать объявления
uz: Joylashuvingiz bo'yicha e'lonlarni saralash uchun joriy manzilni ko'rsating

source: Location
ru: Местоположение
uz: Joylashuv

# full_description
source: Detailed description of the ad
ru: Полное описание объявления
uz: E'lonning batafsil tavsifi

# deleteAccount_success
source: Your account has been successfully deleted.
ru: Ваш аккаунт успешно удален.
uz: Sizning profilingiz muvaffaqiyatli o'chirildi.

# delete_instruction
source: Instructions for deleting an account
ru: Инструкция по удалению аккаунта
uz: Profilingiz o'chirish bo'yicha ko'rsatmalar

# delete_instructionText
source: Log in to your account again and click {String}
ru: Заново зайдите ваш аккаунт и нажмите кнопку {String}
uz: Profilingizga qayta kiriting va {String} tugmasini bosing

source: Clear
uz: Tushinarli

# want_work
source: Ready to work
ru: Готов работать
uz: Ish ishlashga tayyorman

# dontWant_work
source: Not ready to work
ru: Не готов работать
uz: Ish ishlashga tayyor emasman

# location_title
source: Requires access to device location data in the background
ru: Требуется доступ к данным о местоположении устройства в фоновом режиме
uz: Orqa fonda qurilmaning joylashuv ma'lumotlariga kirish talab qilinadi

# location_permission_desc
source: To ensure the operation of the application during use, this application collects location data. When the application is inactive, location data is not detected.
ru: Чтобы обеспечивать работу приложения во время использования, это приложение собирает данные о местоположении. Когда приложение неактивно, данные о местоположении не определяются.
uz: Ilovani ishlatish paytida ishlashini ta'minlash uchun ushbu dastur joylashuv ma'lumotlarini to'playdi. Ilova faol bo'lmaganda, joylashuv ma'lumotlari aniqlanmaydi.

source: Next
ru: Следующий
uz: Keyingi

source: Back
ru: Назад
uz: Orqaga

source: Add Ads
ru: Добавить объявления
uz: Reklama qo'shish
